package com.example.mobilequizgame.data

const val MAX_NO_OF_QUESTIONS = 10
const val SCORE_INCREASE = 1

val allQuestions = listOf(
    Question("สิ่งใดเกิดก่อน", listOf("ช้อน", "ส้อม", "มีด", "ตะเกียบ"), "ช้อน"),
    Question("ม้าลายมีลายสีอะไร", listOf("ลายสีขาว", "ลายสีดำ", "ลายขาวดำ", "ลายแพนด้า"), "ลายสีขาว"),
    Question("ไก่กับไข่ อะไรเกิดก่อนกัน", listOf("ไก่", "ไข่", "เกิดพร้อมกัน", "ไม่มีข้อถูก"), "ไก่"),
    Question("ฝนตก1ห่า คือฝนตกเต็ม…", listOf("บาตรพระ", "คอห่าน", "โอ่ง", "ขัน"), "บาตรพระ"),
    Question("ไพ่Kingใบไหนที่Kingไม่มีหนวด", listOf("โพธิ์แดง", "โพธิ์ดำ", "ดอกจิก", "ข้าวหลามตัด"), "โพธิ์แดง"),
    Question("อาหารอะไรมีวันหมดอายุ", listOf("ไม่มีข้อถูก", "ช็อคโกแลต", "น้ำผึ้งดิบ", "น้ำตาล"), "ไม่มีข้อถูก"),
    Question("อักษรตัวสุดท้ายที่ถูกเพิ่มเข้ามาคืออักษรตัวไหน", listOf("J", "Z", "A", "U"), "J"),
    Question("สัตว์อะไรไม่กระพริบตา", listOf("งู", "นกฮูก", "กระต่าย", "แมว"), "งู"),
    Question("แมงมุมเลือดสีอะไร", listOf("เลือดสีน้ำเงิน", "เลือดสีแดง", "เลือดสีเขียว", "เลือดสีโคลน"), "เลือดสีน้ำเงิน"),
    Question("อะไรเป็นผลไม้", listOf("แตงกวา", "มันหวาน", "แครอท", "บล็อคโคลี่"), "แตงกวา"),
    Question("แอปเปิ้ล เป็นพืชตระกูล", listOf("กุหลาบ", "ฝรั่ง", "เบอร์รี", "ซากุระ"), "กุหลาบ"),
    Question("ศาสนาที่คนนับถือมากที่สุด", listOf("คริสต์", "ฮินดู", "พุทธ", "อิสลาม"), "คริสต์"),
    Question("ต้นกำเนิดคาราเต้มาจากประเทศ", listOf("อินเดีย", "จีน", "ญี่ปุ่น", "ภูฏาน"), "อินเดีย"),
    Question("ลูกขนไก่ใช้ขนอะไร", listOf("เป็ด", "ไก่", "ลูกไก่", "หงษ์"), "เป็ด"),
    Question("ลูกขนไก่ใช้ขนกี่ก้าน", listOf("16", "15", "14", "17"), "16"),
    Question("ทองแท้มี่กี่กะรัต", listOf("24", "22", "28", "26"), "24"),
    Question("เรือไททานิก จมลงในมหาสมุทร", listOf("แอตแลนติก", "อาร์กติก", "แอนตาร์กติก", "แปซิฟิก"), "แอตแลนติก"),
    Question("1ลี้คือกี่เมตร", listOf("500", "1000", "750", "1500"), "500"),
    Question("วัดที่อยู่บนเหรียญ50สตางค์คือวัด", listOf("วัดพระธาตุดอยสุเทพ", "วัดอรุณราชวราราม", "วัดภูเขาทอง", "วัดพระมหาธาตุวรมหาวิหาร"), "วัดพระธาตุดอยสุเทพ"),
    Question("แกนโลกเอียงกี่องศา", listOf("23.5", "24.5", "23.45", "24.3"), "23.5"),
    Question("แวนโก๊ะวาดภาพดอกทานตะวันไว้กี่ภาพ", listOf("7", "8", "9", "6"), "7"),
    Question("สายไหมถูกคิดค้นขึ้นโดย", listOf("หมอฟัน", "โรงงานลูกอม", "เด็กประถม", "ช่างซ่อมเครื่องจักร"), "หมอฟัน"),
    Question("ตาดำของแพะมีรูปร่าง", listOf("สี่เหลี่ยม", "วงกลม", "วงรี", "สามเหลี่ยม"), "สี่เหลี่ยม"),
    Question("สัตว์ชนิดไหนที่มีชีวิตเป็นอมตะ", listOf("แมงกะพรุน", "ปลาหมึก", "แมลงสาบ", "ไร"), "แมงกะพรุน"),
    Question("ประเทศที่ธงไม่ได้เป็นรูปสี่เหลี่ยม", listOf("เนปาล", "กาตาร์", "บัลแกเรีย", "ชิลี"), "เนปาล"),
)

class Question(var question: String, var choice: List<String>, var correctAnswer: String)

